{
	"channel": 758947567957442571,
	"rules": {
		"accuracy": {
			"tag": "accuracy",
			"title": "Accurcay",
			"content": "This document is not guaranteed to always be up-to-date as the game rules are modified, however it is the duty of all players to keep this document accurate as game rules are modified. Where this document disagrees with the game rules, players must follow the game rules as they are, rather than their description in this document.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409303221764127
			]
		},
		"bots": {
			"tag": "bots",
			"title": "Bots",
			"content": "Certain game functions may be performed automatically by automated \"bots\"; the behaviour of such bots is not governed by the rules, and any function that bots may perform should be feasible, even if inconvenient, to do manually.\n\nBots are not players.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409324751650838
			]
		},
		"channels": {
			"tag": "channels",
			"title": "Channels",
			"content": "Each subsection of this rule section corresponds to a game channel; as the subsections are created, removed, renamed, or reordered, game channels must be created/removed/renamed/reordered accordingly.",
			"parent_tag": "root",
			"child_tags": [
				"general",
				"proposals",
				"rules",
				"polls",
				"transactions",
				"trades"
			],
			"message_ids": [
				773409348751720458
			]
		},
		"closing-proposals": {
			"tag": "closing-proposals",
			"title": "Closing proposals",
			"content": "Any player may close an open proposal if one or more of the following conditions is met:\n\n* The proposal is at least 48 hours (2 days) old.\n* All active players have cast a vote or abstained from voting on the proposal, and there are more than 2 active players.\n* A majority of active players have voted in favour of or abstained from voting on the proposal, and there are more than 2 active players.\n* A majority of active players have voted against or abstained from voting on the proposal, and there are more than 2 active players.",
			"parent_tag": "proposals",
			"child_tags": [
				"passing-and-failing-proposals"
			],
			"message_ids": [
				773409389926678538
			]
		},
		"conflict-resolution": {
			"tag": "conflict-resolution",
			"title": "Conflict resolution",
			"content": "If multiple proposals describe the modification or addition of sections, paragraphs, or sentences to the same part of the rules, conflicts should be resolved based on the age of the proposal, such that the newer proposal's effect overrides the older one's. For example, if proposal #10 adds a new section \"A\" to the bottom of the rules, and proposal #11 adds a new section \"B\" to the bottom of the rules, and both proposals pass, then regardless of which proposal passed first, section \"B\" will appear below section \"A\" in the rules.",
			"parent_tag": "proposal-content",
			"child_tags": [],
			"message_ids": [
				773409369575522345
			]
		},
		"content": {
			"tag": "content",
			"title": "Content",
			"content": "* All rules should be written in English using proper English grammar and spelling. American and British English spelling are both acceptable.\n* Where applicable, rules should be written using gender-neutral language, with \"they/them/their\" as a third-person pronoun, both singular and plural.\n* Sentences should be separated by a single space.\n* Paragraphs should be separated by a blank line.\n* Each paragraph or list element must be shorter than 1000 characters.\n* Rules may not contain invisible characters besides newlines, normal spaces, and (in special cases) tabs. Non-ASCII characters should be used sparingly.\n* Double quotes should be preferred instead of single quotes. ASCII-compatible straight quotes should be used instead of \"smart\" quotes.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				773409327670362113
			]
		},
		"deleting-proposals": {
			"tag": "deleting-proposals",
			"title": "Deleting proposals",
			"content": "A deleted proposal is closed, but does not pass or fail.\n\nThe author of an open proposal may delete it at any time.",
			"parent_tag": "proposals",
			"child_tags": [],
			"message_ids": [
				773409391440560138
			]
		},
		"dependency-resolution": {
			"tag": "dependency-resolution",
			"title": "Dependency resolution",
			"content": "A proposal may state that it depends on other proposals, meaning that proposal will fail if any proposal it depends on fails.\n\nA proposal may also state it is incompatible with other proposals, in which case that proposal will fail if any proposal it is incompatible with passes.",
			"parent_tag": "proposal-content",
			"child_tags": [],
			"message_ids": [
				773409370774962247
			]
		},
		"editing-proposals": {
			"tag": "editing-proposals",
			"title": "Editing proposals",
			"content": "The author of an open proposal may edit it at any time if it has no votes on it other than its author.\n\nThe author of an open proposal may edit it to add or remove whitespace and fix typos or grammar mistakes, provided the meaning of the proposal and any dependent proposals remains unchanged. Clarifications or additional details must always be added by a new proposal.",
			"parent_tag": "proposals",
			"child_tags": [],
			"message_ids": [
				773409392246521866
			]
		},
		"forbidden-actions": {
			"tag": "forbidden-actions",
			"title": "Forbidden actions",
			"content": "Unless explicitly stated in the rules, all game actions are forbidden.\n\nAny game action that is forbidden (a \"rule violation\") is considered void and does not modify the game state; the action and its consequences are to be reverted.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409305117589506
			]
		},
		"formatting": {
			"tag": "formatting",
			"title": "Formatting",
			"content": "From [GitHub's \"Mastering Markdown\" document](https://guides.github.com/features/mastering-markdown/), the following may be used:\n\n* Emphasis (italics and bold, not including double underscore `__`)\n* Unordered and ordered lists (not nested)\n* Links\n* Inline code\n* Automatic linking for URLs\n* Strikethrough\n\nAdditionally, square brackets `[]` containing a tag will be converted into links to another rule section; e.g. `[%rule-tag]`. Discord mentions (@username, @role, and #channel) may be used, however they are not readable in GitHub-flavored markdown.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				773409347941564426
			]
		},
		"general": {
			"tag": "general",
			"title": "#general",
			"content": "Players may talk freely in the <#758947554162769921> channel.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				773409349200117781
			]
		},
		"glossary": {
			"tag": "glossary",
			"title": "Glossary",
			"content": "The definitions for terms listed here take precedence over their normal English meanings, however any terms defined in a specific section of the rules override these in the section in which they are defined and its subsections. A section may also define terms for use in the whole document.\n\n* **The Game**: The instance of Nomic governed by these rules.\n* **Game Channel**: Any text or voice channel listed under the \"Game Channels\" category of the Discord server.\n* **Game Action**: Any modification of the game state.\n* **Game State**: Every current rule; every non-deleted proposal and any votes on it; every poll and any votes on it; and every message or reaction in any game channel.\n* **The Rules**: The rules of the game, which are described by this document.\n* **Section**: A part of the rules contained under one header. Unless otherwise specified, this does not include its subsections.\n* **Subsection**: A section contained within another another section.\n* **Clause**: A single statement in the rules.\n* **Player**: Any participant of the game who is a member of the Discord server.\n* **Active Player**: Any player who has performed a game action in the preceding 72 hours.\n* **Inactive Player**: Any player who is not an active player.\n* **Reaction**: Unless otherwise specified, always refers to a Discord \"reaction\".\n* **Reacting**: Unless otherwise specified, \"reacting\" to a message indicates adding a Discord \"reaction\" to the message.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409302794469446
			]
		},
		"headers-and-tags": {
			"tag": "headers-and-tags",
			"title": "Headers and tags",
			"content": "* Each section must have a header and a tag.\n* Headers must use [sentence case](https://en.wiktionary.org/wiki/sentence_case), and must be a short, succinct word or phrase (not a complete sentence) describing the section.\n* A section tag must be a string of text begin with a lowercase letter, end with either a lowercase letter or a number, and may contain only lowercase letters `a`-`z`, digits `0`-`9`, and hyphens `-`.\n* A rule's tag should resemble its header.\n* Tags must be unique; no two rule sections may have the same tag.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				773409346264367114
			]
		},
		"lists": {
			"tag": "lists",
			"title": "Lists",
			"content": "* Unordered lists should use a single asterisk followed by a space (`* `) before each list element.\n* Ordered lists should use a single number followed by a period and a space (`1. `) before each list element.\n* The numbers of a ordered list should start at `1` and increase by `1` for each element.\n* Lists should not be nested.\n* Lists should be separated by the paragraphs above and below by a blank line.\n* Two lists of the same type can not be adjacent. (This is treated as one list when converted to Markdown.)\n\nWithin a given list, all elements should have the same style, chosen from the following:\n\n* Elements are words or phrases, and do not end with a period.\n* Elements are clauses ending in a period (or other punctuation), and optionally followed by complete sentences.\n* Elements are complete sentences ending in a period, and optionally followed by more complete sentences.",
			"parent_tag": "style-conventions",
			"child_tags": [],
			"message_ids": [
				773409347022880768
			]
		},
		"meta-rules": {
			"tag": "meta-rules",
			"title": "Meta rules",
			"content": "This section details how the rules are to be applied to the game.",
			"parent_tag": "root",
			"child_tags": [
				"glossary",
				"accuracy",
				"precedence",
				"forbidden-actions",
				"timezones",
				"bots",
				"rule-content",
				"style-conventions"
			],
			"message_ids": [
				773409301644443669
			]
		},
		"opinion-polls": {
			"tag": "opinion-polls",
			"title": "Opinion polls",
			"content": "Players may conduct polls to informally gather opinions about any game relevant topic, called \"opinion polls\". An opinion poll must be clearly labeled as such.\n\nAn opinion poll may only be created if and only if no other opinion poll by that player is currently open. By default, the allowed reactions of an opinion poll are 👍 and 👎, but the opinion poll may specify different allowed reactions for itself.",
			"parent_tag": "polls",
			"child_tags": [],
			"message_ids": [
				773409413507579924
			]
		},
		"passing-and-failing-proposals": {
			"tag": "passing-and-failing-proposals",
			"title": "Passing and failing proposals",
			"content": "When a proposal is closed, it passes if it has more votes in favour than against; otherwise, it fails.\n\nThe player that authored a proposal may fail it at any time if it is open.\n\nAfter a proposal passes, the game state and game rules are modified according to it. The player who passed it must carry out the effects of its passing to the best of their ability.\n\nThe rules may only change as the result of a proposal passing, legally.",
			"parent_tag": "closing-proposals",
			"child_tags": [],
			"message_ids": [
				773409390719926302
			]
		},
		"points": {
			"tag": "points",
			"title": "Points",
			"content": "When a proposal is passed, its author gains 2 points.\nWhen a proposal is enacted, the player that enacted it gains 1 point.",
			"parent_tag": "quantities",
			"child_tags": [],
			"message_ids": [
				773409435854831646
			]
		},
		"polls": {
			"tag": "polls",
			"title": "#polls",
			"content": "A poll is a means of gathering the opinions of players on an issue. A poll is created by sending a message in the <#758947614313676800> channel, provided a rule permits the poll's creation.\n\nPlayers may vote on a poll by reacting to it with a certain reaction, as specified in the rule permitting the poll's creation. No unspecified reactions are permitted.\n\nThe player that posted a poll may edit it freely, as long as such edits do not change the meaning/intent of any existing reactions to the poll.\n\nIn the event of a conflict, the following parts of this section never take precedence over a rule that allows a poll to be created.\n\nEach player may cast only one vote on a given poll; all votes cast by a player who voted for multiple options are ignored.\n\nA poll closes when one or more of the following conditions is met:\n\n* The poll is at least 24 hours old.\n* All active players have voted on the poll, and there are more than two active players.\n* A majority of active players have voted in favour of or against the poll, and there are more than two active players.\n\nWhen a poll is closed, no more votes may be cast on it, and it may not be edited. If more players have voted in favour of the poll than against, the poll passes; otherwise, it fails.",
			"parent_tag": "channels",
			"child_tags": [
				"rule-violation-polls",
				"opinion-polls"
			],
			"message_ids": [
				773409411753312276
			]
		},
		"precedence": {
			"tag": "precedence",
			"title": "Precedence",
			"content": "In the case of a contradiction between clauses, the following criteria are to be considered in turn until a clear determination can be made as to which clause takes precedence:\n\n* If and only if precedence is specified in the relevant rules and is non-contradictory, follow the instructed precedence.\n* The clause which appears last in the rules takes precedence.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409304479793162
			]
		},
		"proposal-content": {
			"tag": "proposal-content",
			"title": "Proposal content",
			"content": "A proposal must describe one or more actions that make changes to the game rules or otherwise alter the game state.\n\nIf a proposal describes a modification to the rules, it must unambiguously specify the rule section(s) to be modified and how they will be modified.\n\nIf a proposal describes the creation of a new rule section, it must specify its title, its content, and should specify its location in relation to an existing rule; if and only if it does not specify a location, then it will be assumed that its location is below all other currently existing rules (this does not apply after the proposal has been enacted).\n\nAny open proposal that does not comply to these rules may be closed as failed at any time.",
			"parent_tag": "proposals",
			"child_tags": [
				"conflict-resolution",
				"dependency-resolution"
			],
			"message_ids": [
				773409369051889724
			]
		},
		"proposals": {
			"tag": "proposals",
			"title": "#proposals",
			"content": "Proposals can be made by posting them to the <#758947579235926056> game channel.\n\nThe first proposal is numbered #1 and each subsequent proposal's number is increased by 1. Deleted proposals retain their number.\n\nA proposal is either open or closed. When it is first submitted a proposal is open. A closed proposal is either passed or failed.",
			"parent_tag": "channels",
			"child_tags": [
				"proposal-content",
				"voting-on-proposals",
				"closing-proposals",
				"deleting-proposals",
				"editing-proposals"
			],
			"message_ids": [
				773409368100175892
			]
		},
		"quantities": {
			"tag": "quantities",
			"title": "Quantities",
			"content": "A quantity is a named property with a numerical value for each player.\n\nBy default any unique quantity added to the game:\n\n* applies to all players.\n* is instantiated at zero.\n* must be an integer.\n* must never have a negative value.\n\nThe below list of quantities is merely informational and may not be an accurate description of the game state. Any existing quantity that is not in the list may be added, along with an optional short description.\n\nList of quantities:\n**ndcell**: N dimensional cellular automata\n**points**: (tradable) Arbitrary reward systems, yay!\n**triangle**: (tradable) A lowly triangle.\n**square**: (tradable) A somewhat less lowly square.\n**rock**: (tradable) Literally a worthless rock.\n**nonagon**: (tradable) A rather irritating polygon.\n**red gem**: (tradable) A translucent stereotypically diamond-shaped red gem.\n**blue gem**: (tradable) Totally not just red gems painted blue.\n**magical artifact**: (tradable) A sphere reading \"Magical artifact\". Possibly (probably) not actually magical.\n**purple coin**: (tradable) A coin coloured purple. It has a black \"C\" engraved in the centre.",
			"parent_tag": "root",
			"child_tags": [
				"resources",
				"points"
			],
			"message_ids": [
				773409433769345077
			]
		},
		"resources": {
			"tag": "resources",
			"title": "Resources",
			"content": "Resources are tradable quantities named in the below weighted set. When it is triggered, the player who triggered it gains one of the quantity named by that action, if it exists.\n\n- Triangle (weight 16, range 1-16)\n- Square (weight 14, range 17-30)\n- Rock (weight 12, range 31-42)\n- Nonagon (weight 9, range 43-51)\n- Red gem (weight 9, range 52-60)\n- Blue gem (weight 6, range 61-66)\n- Magical artifact (weight 4, range 67-70)\n- Purple coin (weight 1, range 71)\n\nAny player who has more than 2 points may trigger the above weighted set, doing this will deduct 2 points from them.",
			"parent_tag": "quantities",
			"child_tags": [],
			"message_ids": [
				773409434990280704
			]
		},
		"root": {
			"tag": "root",
			"title": null,
			"content": null,
			"parent_tag": null,
			"child_tags": [
				"meta-rules",
				"channels",
				"quantities",
				"winning",
				"weighted-sets"
			],
			"message_ids": [
				773409456272441354,
				773409457408442398,
				773409458495422505
			]
		},
		"rule-content": {
			"tag": "rule-content",
			"title": "Rule content",
			"content": "Proposals and rules must not refer to individual players, except by using a Discord mention or by Discord user ID.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409325900234782
			]
		},
		"rule-violation-polls": {
			"tag": "rule-violation-polls",
			"title": "Rule violation polls",
			"content": "If a player (\"the accusing player\") believes that another player (\"the accused player\") has violated the rules, the accusing player may conduct a poll, called a \"rule violation poll\" or \"RVP\", to determine whether a forbidden action was performed. The poll must clearly state it is an RVP, and must specify the accused player, what sections/clauses of the rules they allegedly violated, and some proof of the violation.\n\nIn a rule violation poll, the following reactions are permitted:\n\n* 👍: In favour of the poll, and in favour of a strike.\n* 🤷: In favour of the poll, but against of a strike.\n* 👎: Against the poll, and against a strike.\n\nIn a rule violation poll, any votes cast by the accused player or the author are ignored.\n\nIf the poll passes, the rule violation and its consequences must be reverted.\n\nIf the poll passes and more votes are in favour of a strike (👍 reactions) than against (🤷 and 👎 reactions), the accused player may not perform any game actions for the next 24 hours.",
			"parent_tag": "polls",
			"child_tags": [],
			"message_ids": [
				773409412542890004
			]
		},
		"rules": {
			"tag": "rules",
			"title": "#rules",
			"content": "The <#758947567957442571> channel contains this rules document.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				773409392711303169
			]
		},
		"style-conventions": {
			"tag": "style-conventions",
			"title": "Style conventions",
			"content": "This section and its subsections describe grammatical and stylistic conventions used throughout this ruleset.\n\nAny player may edit the rules to conform to these style conventions. Edits made this way must otherwise be minimal; i.e. they may not change wording or meaning. Note that the meaning of other, linked rule sections must not be changed by such an edit.",
			"parent_tag": "meta-rules",
			"child_tags": [
				"content",
				"headers-and-tags",
				"lists",
				"formatting"
			],
			"message_ids": [
				773409326818787378
			]
		},
		"timezones": {
			"tag": "timezones",
			"title": "Timezones",
			"content": "Unless otherwise specified, all times and dates are specified with respect to UTC.",
			"parent_tag": "meta-rules",
			"child_tags": [],
			"message_ids": [
				773409324097077248
			]
		},
		"trades": {
			"tag": "trades",
			"title": "#trades",
			"content": "The <#771874153372450828> channel is only to be used for trades.\n\nA trade is defined as a message which clearly states:\n- the recipient of the trade (a Discord mention or their ID)\n- a tradable quantity (QUANTITY1) and a positive integer amount (X) to be transferred to the recipient from the author\n- a tradable quantity (QUANTITY2) and a positive integer amount (Y) to be transferred from the recipient to the author\n\nIf the recipient reacts to the trade with 👍, (X) (QUANTITY1) is to be transferred from the author to the recipient and (Y) (QUANTITY2) is to be transferred from the recipient to the author of the trade. This reaction may not be removed.\n\nIf the recipient or author reacts to the trade with 👎, it may not be interacted with again. This reaction may not be removed.\n\nThe trade can only proceed if both users have the quantities in question.\n\nTrades may be deleted, but not edited. Trades may not be deleted after being completed.\n\nNo reaction may be placed on a trade other than 👍 or 👎. No reaction may be placed on a trade by any player other than the recipient of the trade (or the author, in the case of 👎)",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				773409415440629760
			]
		},
		"transactions": {
			"tag": "transactions",
			"title": "#transactions",
			"content": "The <#758947636978909215> channel may be used to modify quantities, but only in ways specifically allowed by other rules.",
			"parent_tag": "channels",
			"child_tags": [],
			"message_ids": [
				773409414279462912
			]
		},
		"voting-on-proposals": {
			"tag": "voting-on-proposals",
			"title": "Voting on proposals",
			"content": "Each player may cast one vote on each open proposal.\n\nPlayers may vote in favour of (vote \"for\") a proposal by reacting to the proposal with 👍, vote against by reacting with 👎, or abstain from voting by reacting with 🤷.\n\nA player may change their vote on an open proposal at any time.",
			"parent_tag": "proposals",
			"child_tags": [],
			"message_ids": [
				773409371480784917
			]
		},
		"weighted-sets": {
			"tag": "weighted-sets",
			"title": "Weighted Sets",
			"content": "A weighted set is a list of actions (which require names), along with positive integer \"weights\".\nWhen a weighted set is \"activated\", an action is executed from this list.\n\nEach action is to be given a \"range\" of numbers. First of all, actions are to be\nsorted by weight in descending order. If multiple actions have the same weight, they are to be sorted alphabetically.\n\nEach action is then to be given an amount of numbers corresponding to their weight, in the order that they are sorted in, starting at 1.\n\nFor example, if action A had a weight of 3, action B had a weight of 2 and action C had a weight of 1, action A would have a range of 1-3, action B would have a range of 4-6, and action C would have a range of 7-7 (or just 7).\n\nWhen the weighted set is \"triggered\", take a random number between 1 and the maximum number in any range of any action. The action to be taken is whichever action has a range containing the number chosen.\n\nWhat it means for an action to be taken is to be defined by the rule specifying the weighted set. It is strongly recommended, but not mandatory, that the rule shows the ranges for each action clearly.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				773409437757997056
			]
		},
		"winning": {
			"tag": "winning",
			"title": "Winning",
			"content": "When one or more players have won, the game ends.",
			"parent_tag": "root",
			"child_tags": [],
			"message_ids": [
				773409436685041664
			]
		}
	}
}